Revit 2027 API
RepeaterBounds.IsCyclical Method
 True if the array doesn't have finite bounds in the given dimension. Cyclical bounds indicate that the array forms a closed loop in the given dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCyclical(
	int dimension
)
Public Function IsCyclical (
	dimension As Integer
) As Boolean
public:
bool IsCyclical(
	int dimension
)
member IsCyclical :
        dimension : int -> bool
Parameters
dimension Int32
 The dimension.
Return Value
Boolean
 True if the bounds are cyclical in the given dimension.
Exceptions
Exception | Condition
ArgumentException |  The dimension is invalid for these bounds.
InvalidOperationException |  The bounds must have at least one dimension.
Remarks
 The dimension begins at 0 and must be in the range [0, number of dimensions in the bounds - 1]. This method does not apply to zero dimensional bounds.
See Also
Reference
RepeaterBounds Class
Autodesk.Revit.DB Namespace